{
  "welcome": "Bienvenue chez Villepin IT !",
  "lang": "English",
  "contactButton": "Contact",

  "intro1": "Mon but : développer des sites qui vous ",
  "intro2": "simplifient ",
  "intro3": "la vie.",

  "profile": {
    "fields": "Mes domaines d'expertise :",
    "website": "Création de sites vitrine",
    "fullStack": "Développement full-stack JavaScript",
    "database": "Gestion de bases de données SQL et NoSQL",
    "teaching": "Formation au développement web",
    "graphics": "Conception UI/UX",
    "about": "À propos de moi :",
    "intro": "Je m’appelle Héloïse de Villepin et j’ai créé Villepin IT en 2022 en tant que développeuse full-stack indépendante. Je vis près de Strasbourg, au cœur de la belle Alsace, et je considère qu’un café au lait est essentiel pour passer une bonne journée.",
    "passions": "En-dehors de la programmation, je suis passionnée par les cultures, les arts et le développement personnel. En ce moment, j’apprends l’allemand et l’espagnol en autodidacte, je peins à l’acrylique et je ne manque pas une occasion d’échanger sur comment devenir un meilleur être humain.",
    "values": "Ayant grandi au Burkina Faso, la bienveillance et la solidarité sont ancrées dans les valeurs que je partage au travers de mon travail et de mon quotidien."
  },

  "experience": {
    "title1": "Expériences pro",
    "title2": "Formation",
    "title3": "Projets"
  },

  "contact": {
    "title" : "Restons en contact !",
    "writeMe": "Écrivez-moi à : ",
    "mail": "heloise",
    "domain_name": "@villepin-it.com",
    "callMe": "Appelez-moi au : ",
    "phone": "+33 7 83 53 83 15",
    "available": "Je suis disponible pour travailler sur votre projet !",
    "notAvailable": "Je ne suis pas encore disponible pour un nouveau projet.",
    "socialNetworks": "Mes réseaux sociaux"
  },

  "alt": {
    "logo": "Logo de l'entreprise Villepin IT, il s'agit des mots \"Villepin IT\" en gras et gris clair sur une forme bleu foncé, avec un petit cercle rose derrière sa partie droite.",
    "picture": "Buste d'Héloïse de Villepin, développeuse freelance de Villepin IT.",
    "contact": "Image illustrant un écran d'ordinateur et un homme avec un mégaphone devant, dans des tons clairs et roses, créée par \"storyset\" sur le site de Freepik."
  }
}